import { Metadata } from "next";
import { FaCrown } from "react-icons/fa";
import { ToastContainer } from "react-toastify";

import Container from "@components/Container";
import Section from "@components/Section";
import Hero from "@components/Hero";
import Feedback from "@components/Feedback";

import {
  ContentWrapper,
  AboutTitle,
  AboutTitleText,
  AboutText,
  ContactTitle,
  ContactTitleText,
  ContactText,
} from "@styles/styled/MainPage.styled";

export const metadata: Metadata = {
  title: "Твій щасливий день",
};

const Home = async () => {
  return (
    <Section>
      <Container>
        <ToastContainer />
        <ContentWrapper>
          <Hero />
          <AboutTitle>
            <FaCrown size={25} color={"#ffdd61"} />
            <AboutTitleText>Наша місія</AboutTitleText>
            <FaCrown size={25} color={"#ffdd61"} />
          </AboutTitle>
          <AboutText>
            <p>
              Мабуть кожна юна дівчинка, вперше приміряючи вдома перед зеркалом
              мамине намисто, одягаючи мамині речі та великі туфлі на шпильці,
              використовуючи губну мамину помаду чи {"рум'яна"}, подумки мріє
              подорослішати, на мить перевтілитись та стати схожою на справжню
              леді.
            </p>
            <p>
              Ми - один з перших українських креативних дитячих фотопроєктів,
              мета якого - допомогти реалізувати ці дитячі мрії, перевтілити
              дівчаток в різноманітних персонажів - від елегантної леді до
              казкової принцеси, зробити дитячу фотосесію незабутньою подією для
              Вас і Вашої дитини.
            </p>
            <p>
              Наша команда дуже відповідально підходить до кожного проєкту і
              створює ідеальний образ кожного персонажа. Ми ретельно підбираємо
              макіяж, зачіску та аксесуари, щоб підкреслити природну красу і
              виразити унікальну особистість кожної маленької моделі. Під час
              фотосесії, ми створимо магічну атмосферу, де Ваша донечка разом зі
              своїми подружками зможуть відчути себе справжніми зірками або
              казковими героями. Використовуючи професійне освітлення, красиві
              декорації та професійні фото та відеозйомку ми створимо неповторні
              кадри, щоб зберегти кожну емоцію та відобразити її на знімку.
              Після фотосесії, у Вас буде великий вибір фотографій з яких Ви
              зможете обрати ті, що стануть незабутніми спогадами про дитинство
              Вашої донечки. Кожен знімок буде шедевром, що подумки переноситеме
              в світ дитячих мрій та фантазій.
            </p>
            <p>
              Ми розуміємо, наскільки важливо зберегти згадку про цей особливий
              період у житті кожної дитини і ми зробимо все можливе, щоб ваша
              дитяча фотосесія стала неповторною та гідною називатись одним з
              незабутніх спогадів дитинства.
            </p>
          </AboutText>
          <Feedback />
          <ContactTitle>
            <FaCrown size={25} color={"#ffdd61"} />
            <ContactTitleText>{"Зв'язок з нами"}</ContactTitleText>
            <FaCrown size={25} color={"#ffdd61"} />
          </ContactTitle>
          <ContactText>
            <p>
              Якщо Ви хочете замовити фотосесію або зацікавленні в отриманні
              додаткової інформації щодо наших послуг, вільних до замовлення дат
              у графіку фотосесій, інформації щодо локацій проведення фотосесії
              чи у Вас є будь-які інші запитання - не соромтесь {"зв'язатись"} з
              нашими менеджерами.
            </p>
            <p>
              Скористайтесь для цього нашими контактами, розміщеними на сайті:
              номерами мобільного {"зв'язку"} та адресами соцмереж Instagram,
              Facebook чи Telegram. Ми з радістю надамо Вам будь яку інформацію,
              що Вас цікавить.
            </p>
          </ContactText>
        </ContentWrapper>
      </Container>
    </Section>
  );
};

export default Home;
