"use client";

import { AboutTitle, AboutText } from "@styles/styled/About.styled";

const About: React.FC = () => {
  return (
    <>
      <AboutTitle>Наша місія</AboutTitle>
      <AboutText>
        <p>
          Мабуть кожна маленька дівчинка, вперше приміряючи вдома перед зеркалом
          мамине намисто, одягаючи мамині речі та великі туфлі на шпильці,
          використовуючи губну мамину помаду чи {"рум'яна"}, подумки мріє на
          мить перевтілитись та стати дорослою.
        </p>
        <p>
          Ми - один з перших українських креативних дитячих фотопроєктів, метою
          якого є допомога в реалізації цих дитячих мрій; перевтіленні дівчаток
          в різноманітних персонажів: від елегантної леді до казкової принцеси;
          намаганні зробити дитячу фотосесію незабутньою подією для Вас і Вашої
          дитини.
        </p>
        <p>
          Наша команда дуже відповідально підходить до кожного проєкту і створює
          ідеальний образ кожного персонажа. Ми ретельно підбираємо макіяж,
          зачіску та аксесуари, щоб підкреслити природну красу і виразити
          унікальну особистість кожної маленької модельки. Під час фотосесії, ми
          створимо магічну атмосферу, де Ваша донечка разом зі своїми подружками
          зможуть відчути себе справжніми зірками чи казковими героями.
          Використовуючи професійне освітлення, красиві декорації та професійну
          фотозйомку, ми створимо та збережемо неповторні кадри, вловлючи кожну
          емоцію та передаючи її на знімку. Після фотосесії, у Вас буде великий
          вибір фотографій з яких Ви зможете обрати ті, що стануть незабутніми
          спогадами про дитинство Вашої донечки. Кожен знімок буде шедевром, що
          подумки переноситеме в світ дитячих мрій та фантазій.
        </p>
        <p>
          Ми розуміємо, наскільки важливо зберегти згадку про цей особливий
          період у житті кожної дитини, тому робимо усе можливе, щоб дитяча
          фотосесія стала легкою і неповторною та була гідною називатись одним з
          незабутніх спогадів дитинства.
        </p>
      </AboutText>
    </>
  );
};

export default About;
